art_share_API/app/controllers/artwork_shares_controller.rb

    def create
        @artwork_share = ArtworkShare.new(artwork_shares_params)

        if @artwork_share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 2], ["viewer_id", 3], ["created_at", "2021-07-22 16:09:38.579566"], ["updated_at", "2021-07-22 16:09:38.579566"]]