art_share_API/app/controllers/artworks_controller.rb

    def index
        artworks_owned = Artwork.find_by(artist_id: params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 LIMIT $2  [["artist_id", 2], ["LIMIT", 1]]

    def update
        @artwork = Artwork.find(params[:id])
        if @artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1 WHERE "artworks"."id" = $2  [["image_url", "https://upload.wikimedia.org/wikipedia/commons/e/ec/Mona_Lisa%2C_by_Leonardo_da_Vinci%2C_from_C2RMF_retouched.jpg"], ["id", 1]]

    def create
        # debugger
        @artwork = Artwork.new(artwork_params)

        if @artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "thelastsupper "], ["image_url", "louvre.com"], ["artist_id", 2]]