art_share_API/app/controllers/comments_controller.rb

    def create
        @comment = Comment.new(params_comments)
        if @comment.save
---
INSERT INTO "comments" ("user_id", "artwork_id", "body") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 19], ["artwork_id", 10], ["body", "Wow shes cute"]]

    def index

        @source = (params.include?(:user_id)) ? (User.find(params[:user_id])) : (Artwork.find(params[:artwork_id]))
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]