art_share_API/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "amin"], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
    def index

        # debugger
        if params.include?(:query)
            @user = User.find_by(username: params[:query])
            render json: @user
        else
            @users = User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Quinn"], ["email", "quinn@gmail.com"], ["created_at", "2021-07-21 19:07:54.718094"], ["updated_at", "2021-07-21 19:07:54.718094"]]
---
    def create
        user = User.new(user_params)
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "name" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "barbara@gmail.com"], ["name", "barbara"], ["updated_at", "2021-07-21 19:34:11.393861"], ["id", 2]]
---
    def update
        # @id = params[:id]
        @user = User.find(params[:id])
        if @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
    def destroy
        debugger
        User.destroy(params[:id])